{
  "AppBar": {
    "title": "My Portfolio",
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "contact": "Contact",
    "language": "Language",
    "theme": "Theme",
    "light": "Light",
    "dark": "Dark",
    "system": "System",
    "download_cv": "Download My CV"
  },
  "Homepage": {
    "computer_engineer": "Computer Engineer",
    "frontend_web_developer": "Frontend Web Developer",
    "about_title": "About Me",
    "greeting": "Hello, I'm Mehmet Baran ÇAKMAK",
    "description": "I'm a Frontend Developer with 3 years of experience specializing in modern web technologies. While developing high-performance and aesthetic interfaces that prioritize user experience, I bring projects to life using current tools like React, Next.js, and TypeScript.",
    "what_i_do_title": "What I Do?",
    "what_i_do": [
      "I develop scalable, dynamic, and SEO-friendly web applications with React & Next.js.",
      "I use TypeScript to make the codebase more secure and maintainable.",
      "I build accessible and user-friendly interfaces by adopting user-centered design principles.",
      "I deliver high-speed and seamless experiences with performance optimization (Lazy Loading, Code Splitting, caching) and modern CSS (CSS-in-JS, Tailwind) techniques.",
      "I deliver projects on time and efficiently by adapting to teamwork with Agile methodologies (Scrum, Kanban)."
    ],
    "professional_approach_title": "My Professional Approach:",
    "professional_approach": [
      {
        "title": "Passion for Technology",
        "description": "I integrate new trends like AI integrations, micro frontends, and PWAs into projects."
      },
      {
        "title": "Problem Solving",
        "description": "I'm skilled at transforming complex requirements into simple, sustainable, and effective solutions."
      },
      {
        "title": "Team Harmony",
        "description": "I create a harmonious work culture by collaborating seamlessly with designers, backend developers, and product teams."
      },
      {
        "title": "Detail-Oriented",
        "description": "I produce consistent products with attention to code quality, performance optimization, and user experience details."
      }
    ],
    "technologies_I_use": "Technologies I Use"
  },
  "Experiences": {
    "title": "My Experiences",
    "subtitle": "Experiences I've gained throughout my professional career",
    "Edulog": {
      "company": "Edulog Education R&D IT Industry Ltd.",
      "position": "Frontend Developer",
      "period": "February 2023 - May 2025",
      "description": [
        "I created all management and reporting pages for 5 different projects that a school would need using Next.js.",
        "I built a session management system with AWS Cognito.",
        "I developed performance-oriented, dynamic pages using Islands Architecture.",
        "I developed state management modules to manage complex business rules using Redux.",
        "I designed complex forms with dynamic validation rules using React Hook Form.",
        "I implemented REST API integrations for location-based third-party services.",
        "I managed multiple projects and shared libraries from a single source using NX Monorepo."
      ]
    },
    "KSHabithouse": {
      "company": "KS HABITHOUSE",
      "position": "Freelance Frontend Developer",
      "period": "March 2025 – Nowadays",
      "description": [
        "I developed a real estate management system and customer interface with React.",
        "I designed complex forms with dynamic validation rules using Formik.",
        "I increased project sustainability by developing reusable components and React hooks.",
        "I developed high-performance CRUD interfaces using Chakra UI.",
        "I developed state management modules using Zustand."
      ]
    },
    "AdanaEmlak": {
      "company": "Adana Region Real Estate Construction",
      "position": "OBI Responsible Officer",
      "period": "February 2022 - February 2023",
      "description": [
        "I managed corporate IT infrastructure and technical support processes.",
        "I performed maintenance, installation and troubleshooting of computer network systems and hardware components."
      ]
    },
    "technologies": {
      "nextjs": "Next.js",
      "react": "React",
      "typescript": "TypeScript",
      "redux": "Redux",
      "awsCognito": "AWS Cognito",
      "nxMonorepo": "NX Monorepo",
      "tailwind": "Tailwind CSS",
      "jest": "Jest",
      "rtl": "React Testing Library",
      "mui": "MUI",
      "tanstackTable": "Tanstack Table",
      "formik": "Formik",
      "chakra": "Chakra UI",
      "zustand": "Zustand",
      "crud": "CRUD",
      "itManagement": "IT Management",
      "networkSystems": "Network Systems",
      "techSupport": "Technical Support"
    }
  },
  "Footer": {
    "title": "Contact Us",
    "description": "Contact me for collaboration or just to say hello!",
    "copyright": "All rights reserved. Designed and developed by Mehmet Baran ÇAKMAK.",
    "yourName": "Your Name",
    "builtWith": "Built with"
  },
  "About": {
    "about_title": "About Me",
    "description": "As a passionate Frontend Developer with 3 years of professional experience, I continue to advance my career in modern web technologies. I strengthened my technical foundation with a Bachelor's degree in Computer Engineering from Harran University and further deepened my expertise through master's studies at İskenderun Technical University. After gaining industry experience, I now work as a freelance Frontend Developer in Adana.",
    "professional_journey": "My Professional Journey",
    "journey_description_edulog": "During my role as a Mid Frontend Developer at Edulog Eğitim Arge Bilişim, the experience I gained while developing innovative solutions for the education sector became the most formative process of my career. Building 5 different management and reporting projects with Next.js, AWS Cognito integrations, and performance-oriented dynamic pages using Islands Architecture were concrete examples of my technical competencies.",
    "journey_description_habithouse": "As a freelancer, the real estate management system I developed for KS Habithouse strengthened my mastery of the React ecosystem and my independent project management skills. The high-performance CRUD interfaces I built with modern tools like Chakra UI and Zustand became a testament to my customer-centric approach.",
    "technical_expertise": "My Technical Areas of Expertise",
    "technical_description": "My expertise in the modern frontend ecosystem enables flexible selection of optimal technology stacks tailored to project requirements:",
    "technical": [
      "React & Next.js: Scalable, SEO-friendly applications with CSR, SSR, and SSG approaches",
      "State Management: Complex state management with Redux, RTK Query, and Zustand",
      "Form Solutions: Validation-focused form management using React Hook Form + yup/zod",
      "Testing Culture: 85%+ test coverage target with Jest and React Testing Library",
      "CSS Strategies: Modular design with Tailwind, Styled Components, and CSS Modules",
      "Monorepo Management: Multi-project architecture and shared libraries using NX",
      "Performance Optimization: Lazy Loading, Code Splitting, and caching mechanisms"
    ],
    "professional_philosophy": "Professional Philosophy",
    "philosophy_description": "I have made it my mission to leverage technology as a tool to solve all kinds of problems. In every interface I develop:",
    "philosophy": [
      "User Experience: Accessibility (a11y) standards and user-centric design principles",
      "Code Quality: Clean code practices, type safety (TypeScript), and maintainability",
      "Performance: Lighthouse score-driven optimizations",
      "Collaboration: Disciplined teamwork with Agile (Scrum/Kanban) methodologies"
    ],
    "last_word": "Last Word",
    "last_description": "Building bridges between technology and human needs is not just a profession for me, but a passion. I'm always excited to take on new projects, collaborate with professionals from different disciplines, and push my boundaries.",
    "last_description_1": "You can explore the projects in my portfolio to get an idea of my work approach. I'd be delighted to connect about new opportunities where I can create innovative solutions.",
    "Interests": {
      "title": "My Interests",
      "subtitle": "Topics I'm curious about and spend time on",
      "film": {
        "title": "Watching Movies",
        "description": "Special interest in indie cinema and classic films"
      },
      "music": {
        "title": "Music",
        "description": "Listening to alternative rock and electronic music, playing guitar"
      },
      "design": {
        "title": "Design",
        "description": "User experience and minimal interface designs"
      },
      "travel": {
        "title": "Travel",
        "description": "Exploring new cultures and taking nature photographs"
      }
    }
  }
}
