{
  "AppBar": {
    "title": "Portfölyüm",
    "home": "Ana Sayfa",
    "about": "Hakkımda",
    "projects": "Projeler",
    "contact": "İletişim",
    "language": "Dil",
    "theme": "Tema",
    "light": "Açık",
    "dark": "Koyu",
    "system": "Sistem",
    "download_cv": "CV'mi İndir"
  },
  "Homepage": {
    "computer_engineer": "Bilgisayar Mühendisi",
    "frontend_web_developer": "Frontend Web Geliştirici",
    "about_title": "Hakkımda",
    "greeting": "Merhaba, ben Mehmet Baran ÇAKMAK",
    "description": "3 yıllık deneyimle modern web teknolojileri üzerine uzmanlaşmış bir Frontend Developer'ım. Kullanıcı deneyimini ön planda tutan, performanslı ve estetik arayüzler geliştirken, React, Next.js ve TypeScript gibi güncel araçlarla projeleri hayata geçiriyorum.",
    "what_i_do_title": "Neler Yapıyorum?",
    "what_i_do": [
      "React & Next.js ile ölçeklenebilir, dinamik ve SEO dostu web uygulamaları geliştiriyorum.",
      "TypeScript kullanarak kod tabanının daha güvenli ve sürdürülebilir olmasını sağlıyorum.",
      "Kullanıcı odaklı tasarım ilkelerini benimseyerek, erişilebilir ve kullanıcı dostu arayüzler inşa ediyorum.",
      "Performans optimizasyonu (Lazy Loading, Code Splitting, caching) ve modern CSS (CSS-in-JS, Tailwind) teknikleriyle yüksek hızlı ve sorunsuz deneyimler sunuyorum.",
      "Agile metodolojileri (Scrum, Kanban) ile ekip çalışmasına uyum sağlayarak, projeleri zamanında ve verimli şekilde teslim ediyorum."
    ],
    "professional_approach_title": "Profesyonel Yaklaşımım:",
    "professional_approach": [
      {
        "title": "Teknoloji Tutkusu",
        "description": "AI entegrasyonları, mikro frontend'ler ve PWA'lar gibi yeni trendleri projelere entegre ederim."
      },
      {
        "title": "Problem Çözme",
        "description": "Karmaşık gereksinimleri basit, sürdürülebilir ve etkili çözümlere dönüştürme konusunda yetenekliyim."
      },
      {
        "title": "Ekip Uyumu",
        "description": "Tasarımcılar, backend geliştiriciler ve ürün ekipleriyle sorunsuz iş birliği yaparak uyumlu çalışma kültürü oluşturuyorum."
      },
      {
        "title": "Detay Odaklı",
        "description": "Kod kalitesi, performans optimizasyonu ve kullanıcı deneyimi detaylarına verdiğim önemle tutarlı ürünler ortaya koyuyorum."
      }
    ],
    "technologies_I_use": "Kullandığım Teknolojiler"
  },
  "Experiences": {
    "title": "Deneyimlerim",
    "subtitle": "Profesyonel kariyerim boyunca edindiğim deneyimler",
    "Edulog": {
      "company": "Edulog Eğitim Arge Bilişim Sanayi Ltd.",
      "position": "Frontend Developer",
      "period": "Şubat 2023 - Mayıs 2025",
      "description": [
        "Next.js ile bir okulun ihtiyaç duyacağı 5 farklı proje için tüm yönetim ve raporlama sayfalarını oluşturdum.",
        "AWS Cognito ile oturum yönetim sistemi oluşturdum.",
        "Adalar mimarisi(Islands Architecture) kullanarak performans odaklı, dinamik sayfalar geliştirdim.",
        "Redux kullanarak karmaşık iş kurallarını yönetmek için state management modülleri geliştirdim.",
        "React Hook Form ile dinamik validasyon kuralları içeren kompleks formlar tasarladım.",
        "Konum bazlı üçüncü taraf servislerin REST API entegrasyonlarını gerçekleştirdim.",
        "NX Monorepo ile birden fazla projenin ve paylaşımlı kütüphanelerin tek bir merkezden yönetimini sağladım.",
        "MUI DataGrid ve Tanstack table kullanarak gelişmiş ve kompleks veri tabloları oluşturdum.",
        "Jest ve React Testing Library kullanarak bileşenlerin unit testlerini yazdım; test kapsamını (coverage) artırarak uygulamanın sürdürülebilirliğini sağladım.",
        "Tailwind CSS ve Styled Components kullanarak tamamen responsive ve Figma’ya göre pixel-perfect UI'lar geliştirdim."
      ]
    },
    "KSHabithouse": {
      "company": "KS HABITHOUSE",
      "position": "Freelance Frontend Developer",
      "period": "Mart 2025 – Günümüz",
      "description": [
        "React ile emlak yönetim sistemi ve müşteri arayüzü geliştirdim.",
        "Formik ile dinamik validasyon kuralları içeren kompleks formlar tasarladım.",
        "Tekrar kullanılabilir komponentler ve React hook'lar geliştirerek projelerin sürdürülebilirliğini artırdım.",
        "Chakra UI kullanarak yüksek performanslı CRUD arayüzleri geliştirdim.",
        "Zustand kullanarak state management modülleri geliştirdim."
      ]
    },
    "AdanaEmlak": {
      "company": "Adana Bölge Emlak İnşaat",
      "position": "OBİ Sorumlu Subayı",
      "period": "Şubat 2022 - Şubat 2023",
      "description": [
        "Kurumsal IT altyapısının yönetimi ve teknik destek süreçlerini yürüttüm.",
        "Bilgisayar ağ sistemleri ve donanım bileşenlerinin bakım, kurulum ve sorun giderme işlemlerini gerçekleştirdim."
      ]
    },
    "technologies": {
      "nextjs": "Next.js",
      "react": "React",
      "typescript": "TypeScript",
      "redux": "Redux",
      "awsCognito": "AWS Cognito",
      "nxMonorepo": "NX Monorepo",
      "tailwind": "Tailwind CSS",
      "jest": "Jest",
      "rtl": "React Testing Library",
      "mui": "MUI",
      "tanstackTable": "Tanstack Table",
      "formik": "Formik",
      "chakra": "Chakra UI",
      "zustand": "Zustand",
      "crud": "CRUD",
      "itManagement": "IT Yönetimi",
      "networkSystems": "Ağ Sistemleri",
      "techSupport": "Teknik Destek"
    }
  },
  "Footer": {
    "title": "İletişime Geçin",
    "description": "İşbirliği için veya sadece bir merhaba demek için bana ulaşabilirsiniz!",
    "copyright": "Tüm hakları saklıdır. Mehmet Baran ÇAKMAK tarafından tasarlanmış ve geliştirilmiştir.",
    "yourName": "Mehmet Baran ÇAKMAK",
    "builtWith": "Şu teknolojilerle geliştirilmiştir"
  },
  "About": {
    "about_title": "Hakkımda",
    "description": "3 yıllık profesyonel deneyime sahip, modern web teknolojilerine tutkulu bir Frontend Developer olarak kariyerimi sürdürüyorum. Harran Üniversitesi'nde tamamladığım Bilgisayar Mühendisliği lisans eğitimim ve İskenderun Teknik Üniversitesi'ndeki yüksek lisans çalışmalarımla teknik altyapımı güçlendirdim. Edindiğim sektör deneyiminin ardından, şu anda Adana'da bağımsız bir Frontend Developer olarak çalışmalarıma devam ediyorum.",
    "professional_journey": "Profesyonel Yolculuğum",
    "journey_description_edulog": "Edulog Eğitim Arge Bilişim'deki Mid Frontend Developer pozisyonumda, eğitim sektörüne yönelik yenilikçi çözümler geliştirirken edindiğim deneyimler beni şekillendiren en önemli süreç oldu. Next.js ile inşa ettiğim 5 farklı yönetim ve raporlama projesi, AWS Cognito entegrasyonları ve Adalar mimarisi (Islands Architecture) kullanarak oluşturduğum performans odaklı dinamik sayfalar, teknik yetkinliklerimi somutlaştıran çalışmalar oldu.",
    "journey_description_habithouse": "Freelance olarak KS Habithouse için geliştirdiğim emlak yönetim sistemi, React ekosistemindeki hakimiyetimi ve bağımsız proje yönetme becerilerimi güçlendirdi. Chakra UI ve Zustand gibi modern araçlarla oluşturduğum yüksek performanslı CRUD arayüzleri, müşteri memnuniyetini ön planda tutan yaklaşımımın göstergesi oldu.",
    "technical_expertise": "Teknik Uzmanlık Alanlarım",
    "technical_description": "Güncel frontend ekosistemine hakimiyetim, projelerin ihtiyaçlarına göre en uygun teknoloji yığınını seçebilme esnekliği sunuyor:",
    "technical": [
      "React & Next.js: CSR, SSR ve SSG yaklaşımlarıyla ölçeklenebilir, SEO dostu uygulamalar",
      "State Management: Redux, RTK Query ve Zustand ile karmaşık state yönetimi",
      "Form Çözümleri: React Hook Form + yup/zod ile validasyon odaklı form yönetimi",
      "Test Kültürü: Jest ve React Testing Library ile %85+ test coverage hedefi",
      "CSS Stratejileri: Tailwind, Styled Components ve CSS Modules ile modüler tasarım",
      "Monorepo Yönetimi: NX ile çoklu proje mimarisi ve paylaşımlı kütüphaneler",
      "Performans Optimizasyonu: Lazy Loading, Code Splitting ve caching mekanizmaları"
    ],
    "professional_philosophy": "Profesyonel Felsefem",
    "philosophy_description": "Teknolojiyi araç olarak kullanarak her türlü soruna çözüm üretmeyi misyon edindim. Geliştirdiğim her arayüzde:",
    "philosophy": [
      "Kullanıcı Deneyimi: Erişilebilirlik (a11y) standartları ve kullanıcı odaklı tasarım ilkeleri",
      "Kod Kalitesi: Temiz kod prensipleri, tip güvenliği (TypeScript) ve sürdürülebilirlik",
      "Performans: Lighthouse skorlarını maksimize eden optimizasyonlar",
      "İş Birliği: Agile (Scrum/Kanban) metodolojileriyle disiplinli ekip çalışması"
    ],
    "last_word": "Son Söz",
    "last_description": "Teknolojiyi insan ihtiyaçlarıyla buluşturan köprüler inşa etmek benim için sadece bir meslek değil, bir tutku. Yeni projelerde yer almak, farklı disiplinlerden profesyonellerle çalışmak ve sınırlarımı genişletmek için her zaman heyecan duyuyorum.",
    "last_description_1": "Portfolyomdaki projeleri inceleyerek çalışma tarzım hakkında fikir edinebilirsiniz. Yaratıcı çözümler üretebileceğim yeni fırsatlar için iletişime geçmekten mutluluk duyarım.",
    "Interests": {
      "title": "İlgi Alanlarım",
      "subtitle": "Merak ettiğim ve zaman ayırdığım konular",
      "film": {
        "title": "Film İzleme",
        "description": "Bağımsız sinema ve klasik filmler özel ilgi alanım"
      },
      "music": {
        "title": "Müzik",
        "description": "Alternatif rock ve elektronik müzik dinlemek, gitar çalmak"
      },
      "design": {
        "title": "Tasarım",
        "description": "Kullanıcı deneyimi ve minimal arayüz tasarımları"
      },
      "travel": {
        "title": "Seyahat",
        "description": "Yeni kültürler keşfetmek ve doğa fotoğrafları çekmek"
      }
    },
    "frontend": "Frontend Geliştirici",
    "react_next": "React & Next.js Uzmanı",
    "ui": "UI/UX Meraklısı",
    "stats": {
      "years_experience": "Yıl Tecrübe",
      "technology": "Teknoloji Uzmanlığı",
      "reference": "Referans"
    }
  }
}
